In [1]:
#Veri Bilimi 101
import pandas as pd

In [3]:
from math import sqrt

In [4]:
oyuncular = {"boy" : [175,177,178,181,182,183,184,188,190],"deneyim" : [4,6,3,2,6,3,7,2,6],
             "maas" : [12,18,15,16,24,20,28,24,32]}

In [5]:
df = pd.DataFrame(oyuncular)

In [6]:
df

   boy  deneyim  maas
0  175        4    12
1  177        6    18
2  178        3    15
3  181        2    16
4  182        6    24
5  183        3    20
6  184        7    28
7  188        2    24
8  190        6    32

In [7]:
# Eğer ortada model diye bir şey yok ise tahmin diye bir şy ortaya koyulamaz
# Model -> Tahmin makemanizması kuran tahminde bulunan bir yapıdır.
# Mantık dahili içersinde sallamadan bir tahminde bulunmak için nasıl bir model kullana bilirim

In [8]:
df.maas.mean() # Deneyim ve boyuna bakmada herkes bu kadar maaş almaktadır

21.0

In [10]:
df.maas - df.maas.mean() # Test Modeli

0    -9.0
1    -3.0
2    -6.0
3    -5.0
4     3.0
5    -1.0
6     7.0
7     3.0
8    11.0
Name: maas, dtype: float64

In [11]:
# Gelen verilen negatif olduğu için karelarinin alınması gerekmektedir.

In [12]:
(df.maas - df.maas.mean()).pow(2).sum()

340.0

In [13]:
filt = (df.boy <=180) # Boy 180 eşit yada kısamı

In [14]:
df1 = df[filt]

In [15]:
df2 = df[~filt]

In [16]:
df1 # Sadece 180 eşit veya küçük olanların verisini bize getirmektedir.

   boy  deneyim  maas
0  175        4    12
1  177        6    18
2  178        3    15

In [18]:
df1.maas.mean()

15.0

In [19]:
df2

   boy  deneyim  maas
3  181        2    16
4  182        6    24
5  183        3    20
6  184        7    28
7  188        2    24
8  190        6    32

In [20]:
df2.maas.mean()

24.0

In [21]:
## Boy ilk bölme oldu bu da onun error
(df1.maas - df1.maas.mean()).pow(2).sum()  + (df2.maas - df2.maas.mean()).pow(2).sum()

178.0

In [22]:
# İkinci Bölme
filt2 = (df2.boy <=185)

In [23]:
df3 = df2[filt2]

In [24]:
df4 = df2[~filt2]

In [25]:
df3

   boy  deneyim  maas
3  181        2    16
4  182        6    24
5  183        3    20
6  184        7    28

In [26]:
df3.maas.mean()

22.0

In [27]:
df4

   boy  deneyim  maas
7  188        2    24
8  190        6    32

In [28]:
df4.maas.mean()

28.0

In [30]:
# İkinci Bölme Error 180 den büyük olanrı terkar kırılmaya uğrattığımız için +2 tande daha veri seti ortaya çıktı

In [34]:
(df1.maas - df1.maas.mean()).pow(2).sum() +(df3.maas - df3.maas.mean()).pow(2).sum()+(df4.maas - df4.maas.mean()).pow(2).sum()

130.0

In [35]:
# Üçüncü Bölme

In [36]:
filt3  = (df3.deneyim <=5)

In [45]:
df5 = df3[filt3]

In [46]:
df6 = df3[~filt3]

In [47]:
df5

   boy  deneyim  maas
3  181        2    16
5  183        3    20

In [48]:
df5.maas.mean()

18.0

In [49]:
df6

   boy  deneyim  maas
4  182        6    24
6  184        7    28

In [50]:
df6.maas.mean()

26.0

In [51]:
# Üçüncü Bölme Error

In [53]:
(df1.maas - df1.maas.mean()).pow(2).sum() +(df4.maas - df4.maas.mean()).pow(2).sum() + (df5.maas - df5.maas.mean()).pow(2).sum()+ (df6.maas - df6.maas.mean()).pow(2).sum()

66.0